2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_MutatieleveringOpDoelbinding/data/Verwerkingssoort-TC02-1-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5670000</ABONNEMENT>
            <NAAM>Geen pop.bep. levering op basis van doelbinding</NAAM>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body><brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
   <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>*</brp:ontvangendePartij>
   <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>*</brp:soortSynchronisatie>
    <brp:abonnementNaam>*</brp:abonnementNaam>
    <brp:categorieDienst>*</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="*">
    <brp:code>*</brp:code>
    <brp:naam>Adoptie ingezetene</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>*</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="*" brp:communicatieID="*">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:samengesteldeNaam brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:samengesteldeNaam brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:geslachtsaanduiding>
        <brp:voornamen>
          <brp:voornaam brp:objecttype="PersoonVoornaam" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">*</brp:voornaam>
          <brp:voornaam brp:objecttype="PersoonVoornaam" brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*" brp:objectSleutel="*">*</brp:voornaam>
          <brp:voornaam brp:objecttype="PersoonVoornaam" brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*" brp:objectSleutel="*">*</brp:voornaam>
          <brp:voornaam brp:objecttype="PersoonVoornaam" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">*</brp:voornaam>
        </brp:voornamen>
        <brp:geslachtsnaamcomponenten>
          <brp:geslachtsnaamcomponent brp:objectSleutel="*" brp:objecttype="PersoonGeslachtsnaamcomponent" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">*</brp:geslachtsnaamcomponent>
          <brp:geslachtsnaamcomponent brp:objectSleutel="*" brp:objecttype="PersoonGeslachtsnaamcomponent" brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*">*</brp:geslachtsnaamcomponent>
          <brp:geslachtsnaamcomponent brp:objectSleutel="*" brp:objecttype="PersoonGeslachtsnaamcomponent" brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">*</brp:geslachtsnaamcomponent>
        </brp:geslachtsnaamcomponenten>
        <brp:naamgebruik brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">*</brp:naamgebruik>
        <brp:naamgebruik brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">*</brp:naamgebruik>
        <brp:nationaliteiten>
          <brp:nationaliteit brp:objecttype="PersoonNationaliteit" brp:verwerkingssoort="Toevoeging"  brp:voorkomenSleutel="*" brp:objectSleutel="*">*</brp:nationaliteit>
		</brp:nationaliteiten>
        <brp:betrokkenheden>*</brp:betrokkenheden>
        <brp:administratieveHandelingen>*</brp:administratieveHandelingen>
      </brp:persoon>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="*" brp:communicatieID="*">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:geslachtsaanduiding>
        <brp:betrokkenheden>*</brp:betrokkenheden>
        <brp:administratieveHandelingen>*</brp:administratieveHandelingen>
      </brp:persoon>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="*" brp:communicatieID="*">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:geslachtsaanduiding>
        <brp:betrokkenheden>*</brp:betrokkenheden>
        <brp:administratieveHandelingen>*</brp:administratieveHandelingen>
      </brp:persoon>	  
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
        </Row>
    </ResultSet>
</Results>