2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_Attendering/data/BRAL0211-TC01-2-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>*</ABONNEMENT>
            <NAAM>*</NAAM>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>034401</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Volledigbericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Attenderingen op personen met gewijzigde bijhoudingspartij (pop.bep.=true)</brp:abonnementNaam>
    <brp:categorieDienst>Attendering</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling">
    <brp:code>01001</brp:code>
    <brp:naam>Geboorte in Nederland</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>017401</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:communicatieID="1">
        <brp:identificatienummers brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:burgerservicenummer>809468657</brp:burgerservicenummer>
          <brp:administratienummer>1010103529</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
          <brp:voornamen>Piet-Hein-is-klein-maar-zijn-daden-zijn groot-vandaar-dat-zijn-5e-voornaam-gaat zorgen-voor-199-tekens-wordt-natuurlijk wel-een-heel-gedoe-om-steeds-maar-weer op-te-schrijven-of-in-te-tikkens</brp:voornamen>
          <brp:voorvoegsel>de</brp:voorvoegsel>
          <brp:scheidingsteken> </brp:scheidingsteken>
          <brp:geslachtsnaamstam>Prins</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datum>*</brp:datum>
          <brp:gemeenteCode>1773</brp:gemeenteCode>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:code>M</brp:code>
        </brp:geslachtsaanduiding>
        <brp:inschrijving brp:voorkomenSleutel="*">*</brp:inschrijving>
        <brp:bijhouding brp:voorkomenSleutel="*">*</brp:bijhouding>
        <brp:voornamen>*</brp:voornamen>
        <brp:geslachtsnaamcomponenten>
          <brp:geslachtsnaamcomponent brp:objecttype="PersoonGeslachtsnaamcomponent" brp:voorkomenSleutel="*">*</brp:geslachtsnaamcomponent>
        </brp:geslachtsnaamcomponenten>
        <brp:naamgebruik brp:voorkomenSleutel="*">*</brp:naamgebruik>
        <brp:adressen>
          <brp:adres brp:objecttype="PersoonAdres" brp:voorkomenSleutel="*">*</brp:adres>
        </brp:adressen>
        <brp:nationaliteiten>
          <brp:nationaliteit brp:objecttype="PersoonNationaliteit" brp:voorkomenSleutel="*">*</brp:nationaliteit>
        </brp:nationaliteiten>
        <brp:administratieveHandelingen>*</brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope>
</DATA>
        </Row>
    </ResultSet>
</Results>