2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_MutatieleveringOpDoelbinding/data/happy-flow-TC0201-2-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5670000</ABONNEMENT>
            <NAAM>Geen pop.bep. levering op basis van doelbinding</NAAM>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
  <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
   <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>034401</brp:ontvangendePartij>
   <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>91df099d-46ad-4700-bae0-df1f61e5623f</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>*</brp:soortSynchronisatie>
    <brp:abonnementNaam>*</brp:abonnementNaam>
    <brp:categorieDienst>*</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="Toevoeging">
    <brp:code>03002</brp:code>
    <brp:naam>Wijziging gezag</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>036101</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Wijziging" brp:communicatieID="*">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>*</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>*</brp:actieVerval>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>*</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>2005-12-01</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>338451092</brp:burgerservicenummer>
          <brp:administratienummer>3827354291</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>2005-12-01</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
          <brp:voornamen>Marijke</brp:voornamen>
          <brp:voorvoegsel>ter</brp:voorvoegsel>
          <brp:scheidingsteken>-</brp:scheidingsteken>
          <brp:geslachtsnaamstam>Aar</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datum>2005-12-01</brp:datum>
          <brp:gemeenteCode>0093</brp:gemeenteCode>
          <brp:woonplaatsnaam>Twello</brp:woonplaatsnaam>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>2005-12-01</brp:datumAanvangGeldigheid>
          <brp:code>V</brp:code>
        </brp:geslachtsaanduiding>
        <brp:betrokkenheden>
          <brp:kind brp:objecttype="Betrokkenheid" brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:familierechtelijkeBetrekking brp:objecttype="Relatie" brp:verwerkingssoort="Identificatie" brp:objectSleutel="*">
              <brp:betrokkenheden>
                <brp:ouder brp:objecttype="Betrokkenheid" brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Identificatie">
                    <brp:soortCode>I</brp:soortCode>
                    <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1984-12-03</brp:datumAanvangGeldigheid>
                      <brp:burgerservicenummer>337511597</brp:burgerservicenummer>
                      <brp:administratienummer>3758504629</brp:administratienummer>
                    </brp:identificatienummers>
                    <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1984-12-03</brp:datumAanvangGeldigheid>
                      <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                      <brp:voornamen>Anna</brp:voornamen>
                      <brp:voorvoegsel>de</brp:voorvoegsel>
                      <brp:scheidingsteken>-</brp:scheidingsteken>
                      <brp:geslachtsnaamstam>Muurbloem</brp:geslachtsnaamstam>
                    </brp:samengesteldeNaam>
                    <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datum>1984-12-03</brp:datum>
                      <brp:gemeenteCode>0339</brp:gemeenteCode>
                      <brp:woonplaatsnaam>Delft</brp:woonplaatsnaam>
                      <brp:landGebiedCode>6030</brp:landGebiedCode>
                    </brp:geboorte>
                    <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:actieInhoud>*</brp:actieInhoud>
                      <brp:datumAanvangGeldigheid>1984-12-03</brp:datumAanvangGeldigheid>
                      <brp:code>V</brp:code>
                    </brp:geslachtsaanduiding>
                  </brp:persoon>
                  <brp:ouderlijkGezag brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
                    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                    <brp:datumAanvangGeldigheid>${vandaag(0,0,0)}</brp:datumAanvangGeldigheid>
                    <brp:indicatieOuderHeeftGezag>J</brp:indicatieOuderHeeftGezag>
                  </brp:ouderlijkGezag>
                </brp:ouder>
                <brp:ouder brp:objecttype="Betrokkenheid" brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Identificatie">
                    <brp:soortCode>I</brp:soortCode>
                    <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1985-10-11</brp:datumAanvangGeldigheid>
                      <brp:burgerservicenummer>337820399</brp:burgerservicenummer>
                      <brp:administratienummer>3801598721</brp:administratienummer>
                    </brp:identificatienummers>
                    <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1985-10-11</brp:datumAanvangGeldigheid>
                      <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                      <brp:predicaatCode>K</brp:predicaatCode>
                      <brp:voornamen>Gerard</brp:voornamen>
                      <brp:adellijkeTitelCode>R</brp:adellijkeTitelCode>
                      <brp:scheidingsteken>-</brp:scheidingsteken>
                      <brp:geslachtsnaamstam>Appelo</brp:geslachtsnaamstam>
                    </brp:samengesteldeNaam>
                    <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datum>1985-10-11</brp:datum>
                      <brp:gemeenteCode>0339</brp:gemeenteCode>
                      <brp:woonplaatsnaam>Delft</brp:woonplaatsnaam>
                      <brp:buitenlandsePlaats>Brugge</brp:buitenlandsePlaats>
                      <brp:buitenlandseRegio>Oost</brp:buitenlandseRegio>
                      <brp:omschrijvingLocatie>omschrijving geboorte locatie Gerard</brp:omschrijvingLocatie>
                      <brp:landGebiedCode>6030</brp:landGebiedCode>
                    </brp:geboorte>
                    <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1985-10-11</brp:datumAanvangGeldigheid>
                      <brp:code>M</brp:code>
                    </brp:geslachtsaanduiding>
                  </brp:persoon>
                  <brp:ouderlijkGezag brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
                    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                    <brp:actieInhoud>*</brp:actieInhoud>
                    <brp:datumAanvangGeldigheid>${vandaag(0,0,0)}</brp:datumAanvangGeldigheid>
                    <brp:indicatieOuderHeeftGezag>J</brp:indicatieOuderHeeftGezag>
                  </brp:ouderlijkGezag>
                </brp:ouder>
              </brp:betrokkenheden>
            </brp:familierechtelijkeBetrekking>
          </brp:kind>
        </brp:betrokkenheden>
        <brp:administratieveHandelingen>*</brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
        </Row>
    </ResultSet>
</Results>